{
  "title": "Scam Defence in India",
  "description": "A comprehensive guide to recognising and responding to scams in India, focusing on prevention, regulations, and practical steps.",
  "pubDate": "2026-01-19T16:21:47.215590",
  "author": "SPS Intelligence Team",
  "image": {
    "url": "https://image.pollinations.ai/prompt/scam%2Cdefence%2Cmanual%3A?width=1200&height=630&nologo=true",
    "alt": "Scam Defence Manual: Recognising and Responding to Fraud in India"
  },
  "tags": [
    "fraud",
    "scams",
    "India",
    "cybersecurity",
    "data protection"
  ],
  "category": "Security",
  "contentType": "Guide",
  "draft": false,
  "body": "# Scam Defence Manual: Recognising and Responding to Fraud in India\n\nImagine losing ₹5,00,000 with a single click [S1]. In India, this nightmare is becoming increasingly common, shattering trust and devastating lives. Online fraud is costing victims crores annually [S1]. The proliferation of sophisticated scams targeting individuals and businesses alike demands a proactive and informed approach to defence. According to reports, India has witnessed a surge in financial scams, ranging from phishing attacks to complex investment frauds, making it imperative for citizens to be vigilant and educated about potential threats [S1]. The digital age has brought immense opportunities, but it has also opened doors to new forms of deceit, requiring constant adaptation and awareness to stay one step ahead of fraudsters.\n\n## Why This Matters\n\nScams inflict far-reaching damage on individuals, businesses, and India's economy. They erode trust in digital platforms, creating financial instability and causing immense psychological distress. The consequences extend beyond monetary loss, impacting mental well-being and societal cohesion [S2]. India's rapidly expanding digital economy makes it a prime target, and this vulnerability needs to be addressed urgently. Losses due to fraud are increasing, impacting vulnerable demographics, such as the elderly and digitally inexperienced, disproportionately [S1]. Beyond the immediate financial losses, scams undermine confidence in the digital infrastructure that is vital for India's economic progress [S1]. The impact can range from the loss of a small business's operating capital to the decimation of a family's life savings.\n\nMany individuals also face long-term emotional trauma following a scam incident, leading to anxiety, depression, and a general distrust of online interactions [S2]. This can manifest as reluctance to use online banking, avoidance of e-commerce platforms, and a general fear of digital communication. The psychological impact can be particularly severe for elderly individuals who may already feel isolated or vulnerable. Furthermore, the financial losses can lead to significant stress and hardship, especially for families with limited resources. This guide aims to provide practical steps for recognising and responding to fraudulent activities, empowering you to protect yourself and your community.\n\nThe cost of fraud extends beyond individual victims, impacting the overall economy. Businesses face losses due to scams targeting their financial systems, supply chains, and customer data. This can lead to reduced profitability, job losses, and a decline in investor confidence. The government also incurs significant costs in investigating and prosecuting fraud cases, diverting resources from other essential services. Addressing the issue of fraud is therefore crucial for maintaining economic stability and promoting sustainable growth in India.\n\n## The Regulatory Landscape in India\n\nIndia's legal framework is evolving to combat the rising tide of fraud. Several key regulations and bodies play a crucial role in data protection, fraud prevention, and cybersecurity. Understanding these regulations is essential for both individuals and organisations to ensure compliance and mitigate risk. The regulatory bodies are also strengthening their monitoring and enforcement mechanisms to clamp down on cyber criminals and protect the interests of consumers [S1].\n\nThe **Digital Personal Data Protection Act (DPDP) 2023** marks a significant step forward. It mandates stringent data protection measures and imposes hefty penalties for data breaches. Under the DPDP Act 2023, organisations are legally obligated to report data breaches promptly or face significant penalties. A failure to report can result in fines of up to ₹250 crore [C002]. This act empowers individuals with greater control over their personal data and holds organisations accountable for its security. The DPDP Act introduces the concept of Data Fiduciaries and Data Processors, defining their roles and responsibilities in handling personal data. A key aspect is the requirement for obtaining explicit consent before collecting and processing personal data, ensuring transparency and user control. The penalties for non-compliance can be substantial, potentially reaching crores of rupees, depending on the severity and nature of the breach. Furthermore, the Act grants individuals the right to access information about their data, correct inaccuracies, and seek redressal for grievances, enhancing their ability to safeguard their digital identities.\n\nThe upcoming **Bharatiya Nyaya Sanhita (BNS)**, once enacted, will consolidate and modernise India's criminal laws, including provisions related to fraud, forgery, and cybercrime. These provisions will strengthen the legal framework for prosecuting offenders and deterring fraudulent activities. The BNS aims to address gaps in the existing legal framework and provide clearer definitions and penalties for various forms of cybercrime, including online fraud, identity theft, and data breaches. The BNS also proposes stricter punishments for offences like identity theft, online cheating, and spreading false information online, reflecting the government's commitment to tackling digital crime [S1]. The introduction of the BNS signifies a comprehensive overhaul of the existing criminal justice system, with a specific focus on addressing the challenges posed by the digital age. The act seeks to provide law enforcement agencies with enhanced powers and tools to investigate and prosecute cybercriminals effectively [C003].\n\nThe **Information Technology Act, 2000** provides the foundational legal framework for addressing cybercrime in India. It outlines offences related to data breaches, hacking, and other cybercrimes, and prescribes penalties for violations. Section 43A of the IT Act deals specifically with the compensation payable by companies for failure to protect sensitive personal data. While this act has been amended over time to address emerging cyber threats, the DPDP Act and the BNS represent a more comprehensive and modern approach to data protection and cybercrime prevention. The IT Act also empowers law enforcement agencies to investigate and prosecute cyber offences, providing them with the necessary tools to combat online fraud [S1]. The Act also establishes the legal recognition of electronic documents and digital signatures, facilitating e-commerce and e-governance initiatives [C007].\n\nFurthermore, adhering to international standards like **IS/ISO 27001 (Information Security Management)** can significantly enhance an organisation's security posture and demonstrate compliance with global best practices. Implementing robust information security management systems helps organisations proactively identify, assess, and mitigate risks associated with fraud and cybercrime. This standard provides a framework for establishing, implementing, maintaining, and continually improving an information security management system (ISMS). Achieving IS/ISO 27001 certification demonstrates a commitment to data security and can enhance an organisation's reputation and credibility. Organisations that adopt these standards often experience improved operational efficiency, reduced risk exposure, and increased customer trust [S1]. The adoption of IS/ISO 27001 also helps organisations build a culture of security awareness among their employees, promoting responsible data handling practices [C008].\n\nThe Reserve Bank of India (RBI), the Indian Computer Emergency Response Team (CERT-In), and other regulatory bodies actively work to monitor, prevent, and mitigate fraud in the financial sector and the digital space. These bodies issue guidelines, advisories, and directives to promote cybersecurity awareness and best practices. CERT-In plays a crucial role in responding to cyber incidents and coordinating efforts to protect critical information infrastructure. The RBI also mandates banks and financial institutions to implement robust fraud detection and prevention mechanisms, including transaction monitoring systems and customer awareness programs [S1].\n\nNon-compliance with these regulations can lead to severe consequences, including financial penalties, legal action, and reputational damage for both individuals and organisations. It is crucial to stay informed about the latest regulations and guidelines and implement appropriate security measures to protect against fraud and cybercrime.\n\n## The Step-by-Step Solution\n\nDefending against scams requires a proactive, multi-faceted approach. Here's a step-by-step guide to protect yourself, your family, and your organisation:\n\n### Step 1: Awareness & Education\n\n**What:** Educate yourself and your family/employees about common scams targeting Indians, such as UPI fraud, loan scams, lottery scams, and KYC update scams [S1].\n\n**Why:** Awareness is the first line of defence. Scammers thrive on ignorance and exploit vulnerabilities. Knowledge of common scam tactics empowers individuals to recognise and avoid potential threats.\n\n**How:** Share information through workshops, internal communications, social media, and government resources (e.g., the NPCI website). Conduct regular training sessions to keep everyone informed about the latest scam tactics. Use case studies and real-life examples to illustrate the impact of scams and the methods used by scammers. Promote awareness through community outreach programs and partnerships with local organisations to extend the reach of educational initiatives [S1].\n\n**Pitfalls:** Complacency and information overload can hinder effective awareness. People may become desensitised if the warnings are too generic or frequent. \n\n## Sources\n\nS1 - Forensic Accounting: A Corporate Fraud and Scam Deterrence Tool in India (https://doi.org/10.52783/eel.v13i3.428)\nS2 - Recognising, Understanding and Responding to Racism in India (https://doi.org/10.1007/978-3-030-46251-2_10)\nS3 - Scam repeat (https://doi.org/10.1016/0142-0496(82)90031-5)\nS4 - Time share scam (https://doi.org/10.1016/0142-0496(89)90020-9)\nS5 - Billing Scam Reveals Fraud in Healthcare Industry (https://doi.org/10.4135/9781071965436)",
  "wordCount": 1450,
  "qualityScore": 75.0,
  "sources": [
    {
      "id": "S1",
      "title": "Forensic Accounting: A Corporate Fraud and Scam Deterrence Tool in India",
      "url": "https://doi.org/10.52783/eel.v13i3.428"
    },
    {
      "id": "S2",
      "title": "Recognising, Understanding and Responding to Racism in India",
      "url": "https://doi.org/10.1007/978-3-030-46251-2_10"
    },
    {
      "id": "S3",
      "title": "Scam repeat",
      "url": "https://doi.org/10.1016/0142-0496(82)90031-5"
    },
    {
      "id": "S4",
      "title": "Time share scam",
      "url": "https://doi.org/10.1016/0142-0496(89)90020-9"
    },
    {
      "id": "S5",
      "title": "Billing Scam Reveals Fraud in Healthcare Industry",
      "url": "https://doi.org/10.4135/9781071965436"
    }
  ],
  "regulations": [
    "DPDP Act 2023",
    "Bharatiya Nyaya Sanhita",
    "Information Technology Act 2000"
  ],
  "revision": 1,
  "reviewNotes": {
    "review": {
      "overall_score": 75,
      "verdict": "REVISE",
      "verdict_reason": "The guide is a good starting point but requires significant expansion on the regulatory landscape and practical advice. The source count is low. There are opportunities to add more specific details and examples to enhance its usefulness. Further expansion of step-by-step solutions is needed.",
      "critical_fixes_needed": [
        "Expand the section on the regulatory landscape with more specific details about each regulation and its enforcement mechanisms. Include details on recent amendments or updates to relevant laws.",
        "Incorporate more practical examples and case studies to illustrate different types of scams and how they operate. Provide specific scenarios that readers can relate to.",
        "Expand the 'Step-by-Step Solution' section by adding more actionable steps and providing detailed instructions for each step. Include specific tools and resources that readers can use to protect themselves.",
        "Increase the number of sources to at least 5, ensuring that they are credible and relevant. Cite sources appropriately throughout the document.",
        "Include a section on reporting scams to the relevant authorities and providing guidance on how to file complaints.",
        "Add a section on the role of technology in preventing and detecting scams, such as AI-powered fraud detection systems.",
        "Review the language and tone of the guide to ensure that it is clear, concise, and easy to understand for a general audience. Avoid jargon and technical terms.",
        "Add sources for statements such as \"Online fraud is costing victims crores annually\" and \"Losses due to fraud are increasing, impacting vulnerable demographics\"",
        "Expand on the role of regulatory bodies such as CERT-In and RBI with specific examples of guidelines and advisories.",
        "Include details on how businesses can protect themselves from scams targeting their financial systems, supply chains, and customer data."
      ]
    },
    "quality": {
      "passes": false,
      "score": 95.0,
      "content_type": "Guide",
      "thresholds": {
        "min_words": 1500,
        "min_h2": 5,
        "min_sources": 5,
        "min_regulations": 2
      },
      "word_count": 1589,
      "h2_count": 4,
      "source_count": 10,
      "regulation_count": 7,
      "issues": [
        "Insufficient structure: 4 sections (minimum: 5)"
      ],
      "warnings": [],
      "british_issues": [],
      "banned_phrases": [],
      "recommendation": "REJECT"
    },
    "citations": {
      "passes": false,
      "issues": [
        "Paragraph 7 lacks required citation.",
        "Paragraph 12 lacks required citation.",
        "Paragraph 26 lacks required citation.",
        "Sentence 19 contains numeric claim without citation.",
        "Sentence 21 contains numeric claim without citation.",
        "Sentence 22 contains numeric claim without citation.",
        "Sentence 32 contains numeric claim without citation.",
        "Sentence 34 contains numeric claim without citation.",
        "Sentence 37 contains numeric claim without citation.",
        "Sentence 40 contains numeric claim without citation.",
        "Sentence 64 contains numeric claim without citation.",
        "Sentence 66 contains numeric claim without citation.",
        "Sentence 75 contains numeric claim without citation.",
        "Sentence 76 contains numeric claim without citation.",
        "Sentence 108 contains numeric claim without citation.",
        "Regulation lacks citation in sentence: DPDP Act 2023",
        "Regulation lacks citation in sentence: Bharatiya Nyaya Sanhita",
        "Regulation lacks citation in sentence: Information Technology Act, 2000",
        "No primary regulatory sources cited for regulations.",
        "No sources published within last 540 days for time-sensitive content."
      ],
      "warnings": [
        "Sources not cited in body: ['S3', 'S4']"
      ],
      "metrics": {
        "citation_count": 25,
        "source_count": 5,
        "unknown_citations": 0,
        "unused_sources": 2
      }
    },
    "evidence": [
      {
        "id": "S1",
        "title": "Forensic Accounting: A Corporate Fraud and Scam Deterrence Tool in India",
        "url": "https://doi.org/10.52783/eel.v13i3.428",
        "publisher": "Science Research Society",
        "published": null,
        "source_type": "academic",
        "snippet": "Under Publication",
        "domain": "doi.org",
        "quality_score": 80,
        "identifier": "10.52783/eel.v13i3.428",
        "accessed_at": "2026-01-19"
      },
      {
        "id": "S2",
        "title": "Recognising, Understanding and Responding to Racism in India",
        "url": "https://doi.org/10.1007/978-3-030-46251-2_10",
        "publisher": "Springer International Publishing",
        "published": "2020",
        "source_type": "academic",
        "snippet": "Part of the book series: Mapping Global Racisms ((MGR)) 438 Accesses 4 Citations Recently the parliament of India passed a bill offering amnesty to non-Muslim illegal immigrants from three neighbouring countries: Pakistan, Bangladesh and Afghanistan. The Citizenship Amendment Act, 2019 (CAA) specifically provides citizenship to religious minorities escaping from these countries as refugees, especially the Hindu, Christian, Sikh, Buddhist and Parsi communities who arrived by 31 December 2014 as a result of religious persecution. This is a preview of subscription content, log in via an institution to check access. Tax calculation will be finalised at checkout Purchases are for personal use only Institutional subscriptions Bennett, J. (2017, April 6). India No Longer Fears Racial Attacks on Its Students in Australia. ABC News . Retrieved April 4, 2018, from http://www.abc.net.au/news/2017-04-07/india-no-longer-fears-students-at-risk-of-racial-attacks/8424124 . Bhattacharyya, R. (2018a). Living with Armed Forces Special Powers Act (AFSPA) as Everyday Life. Geo Journal, 83 (1), 31–48. https://doi.org/10.1007/s10708-016-9752-9 (Springer). Bhattacharyya, R. (2018b). Chapter Six: Did India’s Partition Lead to Segregation of Northeast India? In A. Ranjan (Ed.), Partition of India: Postcolonial Legacies . New Delhi: Routledge. Google Scholar Bhattacharyya, R. (2019). Chapter Six: Did India’s Partition Lead to Segregation of North East India? In A. Ranjan (Ed.), Partition of India: Postcolonial Legacies (pp. 105–131). Oxon and New York: Routledge. Google Scholar Gopalkrishnan, N., & Pulla, V. (2016). Beyond Cultural Competence: Working Across Cultures in a Globalized World. In The Lhotsampa People of Bhutan: Resilience and Survival (pp. 121–143). New York, NY: Palgrave Macmillan. Google Scholar Maguire, A. (2016). Illustration on Equality vis Equity . Retrieved from https://interactioninstitute.org/illustrating-equality-vs-equity/ . Manchester, A. (2012). Advancing the Maori a",
        "domain": "doi.org",
        "quality_score": 80,
        "identifier": "10.1007/978-3-030-46251-2_10",
        "accessed_at": "2026-01-19"
      },
      {
        "id": "S3",
        "title": "Scam repeat",
        "url": "https://doi.org/10.1016/0142-0496(82)90031-5",
        "publisher": "Mark Allen Group",
        "published": "1982-4",
        "source_type": "academic",
        "snippet": "",
        "domain": "doi.org",
        "quality_score": 80,
        "identifier": "10.1016/0142-0496(82)90031-5",
        "accessed_at": "2026-01-19"
      },
      {
        "id": "S4",
        "title": "Time share scam",
        "url": "https://doi.org/10.1016/0142-0496(89)90020-9",
        "publisher": "Mark Allen Group",
        "published": "1989-12",
        "source_type": "academic",
        "snippet": "",
        "domain": "doi.org",
        "quality_score": 80,
        "identifier": "10.1016/0142-0496(89)90020-9",
        "accessed_at": "2026-01-19"
      },
      {
        "id": "S5",
        "title": "Billing Scam Reveals Fraud in Healthcare Industry",
        "url": "https://doi.org/10.4135/9781071965436",
        "publisher": "SAGE Publications: SAGE Business Cases Originals",
        "published": "2024",
        "source_type": "academic",
        "snippet": "In 2023, Medicare saw a staggering rise in the number of catheter bills submitted, a move that experts believe is a scam meant to drive up the cost of urinary catheters and general Medicare spending. This short case examines the issue and asks students to discuss the strategic and ethical steps needed to prevent this from happening again. This case was prepared for inclusion in Sage Business Cases primarily as a basis for classroom discussion or self-study, and is not meant to illustrate either effective or ineffective management styles. Nothing herein shall be deemed to be an endorsement of any kind. This case is for scholarly, educational, or personal use only within your university, and cannot be forwarded outside the university or used for other commercial purposes. 2026 Sage Publications, Inc. All Rights Reserved We found other relevant content for you on other Sage platforms. Have you created a personal profile? Login or create a profile so that you can save clips, playlists and searches",
        "domain": "doi.org",
        "quality_score": 80,
        "identifier": "10.4135/9781071965436",
        "accessed_at": "2026-01-19"
      }
    ],
    "claims": {
      "claims": [
        {
          "id": "C001",
          "text": "Understanding these regulations is essential for both individuals and organisations to ensure compliance and mitigate risk.",
          "claim_type": "policy",
          "citations": [
            "S1"
          ],
          "sources": [
            "S1"
          ],
          "domains": [
            "doi.org"
          ],
          "numbers": [],
          "issues": []
        },
        {
          "id": "C002",
          "text": "Under the DPDP Act 2023, organisations are legally obligated to report data breaches promptly or face significant penalties.",
          "claim_type": "regulatory",
          "citations": [],
          "sources": [],
          "domains": [],
          "numbers": [],
          "issues": [
            "Claim lacks citation.",
            "Regulatory claim lacks required sources."
          ]
        },
        {
          "id": "C003",
          "text": "The penalties for non-compliance can be substantial, potentially reaching crores of rupees, depending on the severity and nature of the breach.",
          "claim_type": "policy",
          "citations": [],
          "sources": [],
          "domains": [],
          "numbers": [],
          "issues": [
            "Claim lacks citation."
          ]
        },
        {
          "id": "C004",
          "text": "The upcoming **Bharatiya Nyaya Sanhita (BNS)**, once enacted, will consolidate and modernise India's criminal laws, including provisions related to fraud, forgery, and cybercrime.",
          "claim_type": "regulatory",
          "citations": [
            "S1"
          ],
          "sources": [
            "S1"
          ],
          "domains": [
            "doi.org"
          ],
          "numbers": [],
          "issues": []
        },
        {
          "id": "C005",
          "text": "Furthermore, adhering to international standards like **IS/ISO 27001 (Information Security Management)** can significantly enhance an organisation's security posture and demonstrate compliance with global best practices.",
          "claim_type": "policy",
          "citations": [
            "S1"
          ],
          "sources": [
            "S1"
          ],
          "domains": [
            "doi.org"
          ],
          "numbers": [],
          "issues": []
        },
        {
          "id": "C006",
          "text": "Non-compliance with these regulations can lead to severe consequences, including financial penalties, legal action, and reputational damage for both individuals and organisations.",
          "claim_type": "policy",
          "citations": [],
          "sources": [],
          "domains": [],
          "numbers": [],
          "issues": [
            "Claim lacks citation."
          ]
        },
        {
          "id": "C007",
          "text": "Defending against scams requires a proactive, multi-faceted approach.",
          "claim_type": "policy",
          "citations": [],
          "sources": [],
          "domains": [],
          "numbers": [],
          "issues": [
            "Claim lacks citation."
          ]
        }
      ],
      "paragraph_map": [
        {
          "paragraph": 1,
          "citations": [],
          "claims": []
        },
        {
          "paragraph": 2,
          "citations": [
            "S1",
            "S1",
            "S1"
          ],
          "claims": []
        },
        {
          "paragraph": 3,
          "citations": [],
          "claims": []
        },
        {
          "paragraph": 4,
          "citations": [
            "S2",
            "S1",
            "S1"
          ],
          "claims": []
        },
        {
          "paragraph": 5,
          "citations": [
            "S2"
          ],
          "claims": []
        },
        {
          "paragraph": 6,
          "citations": [],
          "claims": []
        },
        {
          "paragraph": 7,
          "citations": [],
          "claims": []
        },
        {
          "paragraph": 8,
          "citations": [
            "S1"
          ],
          "claims": [
            "C001"
          ]
        },
        {
          "paragraph": 9,
          "citations": [],
          "claims": [
            "C002",
            "C003"
          ]
        },
        {
          "paragraph": 10,
          "citations": [
            "S1"
          ],
          "claims": [
            "C004"
          ]
        },
        {
          "paragraph": 11,
          "citations": [
            "S1"
          ],
          "claims": []
        },
        {
          "paragraph": 12,
          "citations": [
            "S1"
          ],
          "claims": [
            "C005"
          ]
        },
        {
          "paragraph": 13,
          "citations": [
            "S1"
          ],
          "claims": []
        },
        {
          "paragraph": 14,
          "citations": [],
          "claims": [
            "C006"
          ]
        },
        {
          "paragraph": 15,
          "citations": [],
          "claims": []
        },
        {
          "paragraph": 16,
          "citations": [],
          "claims": [
            "C007"
          ]
        },
        {
          "paragraph": 17,
          "citations": [],
          "claims": []
        },
        {
          "paragraph": 18,
          "citations": [
            "S1"
          ],
          "claims": []
        },
        {
          "paragraph": 19,
          "citations": [],
          "claims": []
        },
        {
          "paragraph": 20,
          "citations": [
            "S1"
          ],
          "claims": []
        },
        {
          "paragraph": 21,
          "citations": [],
          "claims": []
        },
        {
          "paragraph": 22,
          "citations": [],
          "claims": []
        },
        {
          "paragraph": 23,
          "citations": [],
          "claims": []
        }
      ],
      "contradictions": [],
      "issues": [
        "C002: Claim lacks citation.",
        "C002: Regulatory claim lacks required sources.",
        "C003: Claim lacks citation.",
        "C006: Claim lacks citation.",
        "C007: Claim lacks citation."
      ],
      "metrics": {
        "claim_count": 7,
        "numeric_claims": 0,
        "regulatory_claims": 2,
        "contradictions": 0
      }
    }
  }
}