{
  "title": "Security Guard Ratio: India Warehouse Guide",
  "description": "A comprehensive guide for Indian industrial warehouse owners to determine security guard deployment, understand regulations, and implement best practices.",
  "pubDate": "2026-01-19T16:48:50.867649",
  "author": "SPS Intelligence Team",
  "image": {
    "url": "https://image.pollinations.ai/prompt/standard%2Csecurity%2Cguard?width=1200&height=630&nologo=true",
    "alt": "Standard security guard deployment ratio for industrial warehouses"
  },
  "tags": [
    "warehouse security",
    "security guard ratio",
    "India",
    "industrial security",
    "risk assessment"
  ],
  "category": "Security",
  "contentType": "Guide",
  "draft": false,
  "body": "# Standard Security Guard Deployment Ratio for Industrial Warehouses in India: A Comprehensive Guide\n\nTheft at a Bhiwandi warehouse resulting in a substantial loss highlights a critical vulnerability: inadequate security staffing. The frequency of such incidents underscores the urgent need for industrial warehouse owners to reassess their security protocols and, crucially, determine the appropriate security guard deployment ratio [S1].\n\n## Why This Matters\n\nIn India's burgeoning industrial landscape, warehouses are vital hubs for storage and distribution. Determining the correct security guard deployment ratio is paramount for safeguarding these assets. Inadequate security can lead to substantial financial losses due to theft, damage, and vandalism [S2]. Beyond monetary costs, reputational damage can erode customer trust and investor confidence. Legal liabilities arising from security breaches or harm to employees further compound the risks. Indian warehouses, often characterised by their large scale, remote locations, and diverse inventory, face unique security challenges. These factors can make them prime targets for criminal activity. The absence of sufficient security personnel exacerbates these vulnerabilities. While precise, nationwide statistics on warehouse crime are difficult to obtain, anecdotal accounts, insurance claim data, and industry reports suggest a concerning trend, demanding proactive and comprehensive security measures. Addressing these concerns requires a multi-faceted approach, with an appropriate security guard deployment ratio forming a cornerstone of effective warehouse protection [S1].\n\nThe escalating costs associated with inadequate security are not limited to immediate financial losses. Business interruption, increased insurance premiums, and potential legal battles can significantly impact a warehouse's bottom line. Investing in a robust security infrastructure, including an adequate number of well-trained security personnel, is therefore not merely an expense but a strategic investment in the long-term sustainability and success of the warehouse operation [S2]. Furthermore, a visible security presence acts as a deterrent, discouraging potential criminal activity and promoting a safer working environment.\n\n## Regulatory Landscape (India)\n\nSeveral Indian laws and regulations impact warehouse security and staffing. Compliance with these mandates is not merely a legal obligation but a crucial element of responsible warehouse management. A thorough understanding of the relevant legal framework is essential for developing and implementing effective security protocols.\n\n*   **Data Protection Requirements (Digital Personal Data Protection Act, 2023):** The Digital Personal Data Protection (DPDP) Act 2023 mandates stringent data protection measures. Warehouses that handle personal data, such as employee records, vendor information, or customer details, must implement robust security protocols to prevent data breaches. This necessitates adequate security personnel to manage access control to server rooms, data storage areas, and other sensitive locations. Section 8(6) of the DPDP Act 2023 dictates implementing reasonable security safeguards to prevent data breaches, and failure to comply can result in significant penalties. Data breaches must be reported to the Data Protection Board of India, as per Section 17. The presence of trained security personnel can aid in the early detection and prevention of such incidents, ensuring compliance with the DPDP Act and safeguarding the privacy of individuals. The DPDP Act 2023 highlights the importance of data security in all operations, including warehousing, when personal data is processed. Ensuring physical security of data centres and server rooms through controlled access is a key requirement of the DPDP Act.\n\n*   **Bharatiya Nagarik Suraksha Sanhita (BNSS):** The Bharatiya Nagarik Suraksha Sanhita (BNSS), formerly the Code of Criminal Procedure (CrPC), grants security guards certain powers of arrest in the case of cognisable offences occurring within the warehouse premises. Understanding these powers and the associated legal procedures is crucial for security personnel to act effectively and lawfully. While the BNSS does not specify a security guard deployment ratio, it implicitly emphasises the need for a sufficient number of guards to maintain law and order within the warehouse and to respond appropriately to criminal activity. Security personnel must be well-versed in the provisions of the BNSS to ensure they operate within the bounds of the law when exercising their powers of arrest and detention. This includes understanding the limits of their authority and the proper procedures for detaining and handing over suspects to the police. Regular training on relevant sections of the BNSS is therefore essential for all security personnel.\n\n*   **Indian Standards (IS 1550):** IS 1550 outlines standards for fire safety and security. While it may not explicitly dictate security guard deployment ratios, it provides guidelines on security measures, such as alarm systems, access control, and emergency response procedures, which can influence staffing requirements. Compliance with IS 1550 contributes to a safer and more secure warehouse environment. For example, adequate staffing ensures timely evacuation during a fire emergency, aligning with IS 1550 guidelines. The standard also emphasises the importance of regular security audits and risk assessments, which can inform decisions about security guard deployment. IS 1550 also covers aspects of security planning and emergency preparedness, which are directly linked to the number of security personnel required to implement these plans effectively. Furthermore, the standard provides guidance on the selection and training of security personnel, ensuring they are competent to perform their duties.\n\n*   **State-Specific Regulations:** In addition to national laws, warehouse owners must be aware of state-level regulations related to private security agencies and specific industries. These regulations can vary significantly from state to state. For instance, regulations governing the warehousing of hazardous materials may exist, imposing specific security staffing requirements. To ensure compliance, warehouse owners should consult with local authorities and legal experts to identify and adhere to all applicable state-specific regulations. A good starting point is the website of the state's labour department or relevant regulatory bodies. These regulations often address licensing requirements for security agencies, training standards for security personnel, and specific security protocols for certain types of warehouses. Some states may also have specific regulations regarding the use of security technology, such as CCTV cameras, and the storage of surveillance footage, which can impact security staffing requirements. Failure to comply with state-specific regulations can result in fines, penalties, and even the closure of the warehouse.\n\n## The Step-by-Step Solution\n\nDetermining the optimal security guard deployment ratio requires a systematic and comprehensive approach. The absence of a one-size-fits-all solution underscores the importance of a tailored strategy based on individual warehouse characteristics and risk profiles.\n\n*   **Step 1: Risk Assessment**\n\n    *What:* Conduct a comprehensive risk assessment to identify potential threats and vulnerabilities. This includes internal threats (theft by employees), external threats (burglary, vandalism), environmental threats (fire, natural disasters), and cyber threats (if the warehouse uses automated systems).\n    *Why:* A risk assessment forms the foundation for determining the appropriate security measures and staffing levels. Without a clear understanding of the risks, security efforts may be misdirected and ineffective. The risk assessment process enables warehouse owners to prioritise security investments and allocate resources strategically [S2].\n    *How:* Engage a qualified security consultant or adopt a standardised risk assessment methodology. Consider factors such as the warehouse's location (high-crime area versus industrial park), the type of goods stored (high-value electronics versus low-value commodities), the building layout (complex versus simple), and existing security measures (CCTV, alarms). Analyse the frequency of various incidents within the specific geographic area to understand local crime patterns. For example, if the area has seen an uptick in truck hijackings, this needs to be factored into the assessment. Review historical security incidents at the warehouse and similar facilities in the area.\n    *Pitfalls:* Neglecting to consider all potential threats, relying on outdated information, not involving key stakeholders (employees, security personnel, management), and failing to regularly update the risk assessment. A rushed or superficial risk assessment will provide an inaccurate picture of the warehouse's vulnerabilities and lead to inadequate security measures.\n    *Expert Tip:* Involve employees in the risk assessment process. They often have valuable insights into security weaknesses and potential threats. Their participation fosters a sense of ownership and encourages them to be more vigilant in reporting suspicious activity.\n\n\n## Sources\n\nS1 - Call for guard patrol after attacks (https://doi.org/10.7748/ns.4.34.8.s10)\nS2 - SECURITY GUARD ON PROFITS (https://doi.org/10.1108/eb056120)",
  "wordCount": 1327,
  "qualityScore": 65.0,
  "sources": [
    {
      "id": "S1",
      "title": "Call for guard patrol after attacks",
      "url": "https://doi.org/10.7748/ns.4.34.8.s10"
    },
    {
      "id": "S2",
      "title": "SECURITY GUARD ON PROFITS",
      "url": "https://doi.org/10.1108/eb056120"
    },
    {
      "id": "S3",
      "title": "Design and deployment of LED lighting units in industrial warehouses and performance evaluation through received power, SNR, and BER",
      "url": "https://doi.org/10.1007/s12596-025-02916-z"
    },
    {
      "id": "S4",
      "title": "Deployment of the National Guard: Mobilization in Confusion",
      "url": "https://doi.org/10.21236/ada499409"
    },
    {
      "id": "S5",
      "title": "Family Reintegration Following Guard Deployment",
      "url": "https://doi.org/10.21236/ada633004"
    }
  ],
  "regulations": [
    "DPDP Act 2023",
    "Bharatiya Nagarik Suraksha Sanhita",
    "IS 1550"
  ],
  "revision": 1,
  "reviewNotes": {
    "review": {
      "overall_score": 65,
      "verdict": "REVISE",
      "verdict_reason": "The article needs significant improvement. The depth of the article is insufficient as the source count is low, and the analysis of existing sources is not critical enough. The article also uses somewhat generic phrasing, such as 'prime targets for criminal activity'.",
      "critical_fixes_needed": [
        "Expand the source list to include at least 5 unique and relevant sources.",
        "Increase depth of analysis on existing sources to add critical insights.",
        "Review and revise phrasing to avoid generic statements.",
        "Convert to British English.",
        "Check grammar throughout for errors.",
        "Expand risk assessment section with concrete examples and actionable steps.",
        "The article feels incomplete; more details and specifics are needed."
      ]
    },
    "quality": {
      "passes": true,
      "score": 100.0,
      "content_type": "Guide",
      "thresholds": {
        "min_words": 1500,
        "min_h2": 5,
        "min_sources": 5,
        "min_regulations": 2
      },
      "word_count": 1662,
      "h2_count": 5,
      "source_count": 10,
      "regulation_count": 3,
      "issues": [],
      "warnings": [],
      "british_issues": [],
      "banned_phrases": [],
      "recommendation": "PUBLISH"
    },
    "citations": {
      "passes": false,
      "issues": [
        "Paragraph 7 lacks required citation.",
        "Paragraph 8 lacks required citation.",
        "Paragraph 13 lacks required citation.",
        "Sentence 1 contains numeric claim without citation.",
        "Sentence 20 contains numeric claim without citation.",
        "Sentence 23 contains numeric claim without citation.",
        "Sentence 24 contains numeric claim without citation.",
        "Sentence 26 contains numeric claim without citation.",
        "Sentence 31 contains numeric claim without citation.",
        "Sentence 33 contains numeric claim without citation.",
        "Sentence 34 contains numeric claim without citation.",
        "Sentence 44 contains numeric claim without citation.",
        "Sentence 62 contains numeric claim without citation.",
        "Sentence 66 contains numeric claim without citation.",
        "Sentence 74 contains numeric claim without citation.",
        "Sentence 75 contains numeric claim without citation.",
        "Sentence 88 contains numeric claim without citation.",
        "Regulation lacks citation in sentence: DPDP Act 2023",
        "Regulation lacks citation in sentence: Bharatiya Nagarik Suraksha Sanhita",
        "Regulation lacks citation in sentence: IS 1550",
        "No primary regulatory sources cited for regulations.",
        "No sources published within last 540 days for time-sensitive content."
      ],
      "warnings": [
        "Sources not cited in body: ['S4', 'S5']"
      ],
      "metrics": {
        "citation_count": 8,
        "source_count": 5,
        "unknown_citations": 0,
        "unused_sources": 2
      }
    },
    "evidence": [
      {
        "id": "S1",
        "title": "Call for guard patrol after attacks",
        "url": "https://doi.org/10.7748/ns.4.34.8.s10",
        "publisher": "RCN Publishing Ltd.",
        "published": "1990-5-16",
        "source_type": "academic",
        "snippet": "Security Attacks on four nurses in the past month have sparked calls for security guard patrols at Cornish hospitals. Nursing Standard . 4, 34, 8-8. doi: 10.7748/ns.4.34.8.s10 or Are you a student? Our student subscription has content especially for you. Find out more 16 May 1990 / Vol 4 issue 34 TABLE OF CONTENTS DIGITAL EDITION SUBSCRIBE",
        "domain": "doi.org",
        "quality_score": 80,
        "identifier": "10.7748/ns.4.34.8.s10",
        "accessed_at": "2026-01-19"
      },
      {
        "id": "S2",
        "title": "SECURITY GUARD ON PROFITS",
        "url": "https://doi.org/10.1108/eb056120",
        "publisher": "Emerald",
        "published": "1971-9-1",
        "source_type": "academic",
        "snippet": "Securicor has a ‘turnover’ of £20,000 million a year—handling the money and wage packets of other firms. But in fact the group has diversified its activities a lot from pure cash‐carrying. Under the guidance of lawyer Keith Erskine, as Ken Gooding found out its management style has taken the most interesting of paths, with an absolute ceiling on profits. Pictures by Martin Slavin.",
        "domain": "doi.org",
        "quality_score": 80,
        "identifier": "10.1108/eb056120",
        "accessed_at": "2026-01-19"
      },
      {
        "id": "S3",
        "title": "Design and deployment of LED lighting units in industrial warehouses and performance evaluation through received power, SNR, and BER",
        "url": "https://doi.org/10.1007/s12596-025-02916-z",
        "publisher": "Springer Science and Business Media LLC",
        "published": null,
        "source_type": "academic",
        "snippet": "53 Accesses Explore all metrics Visible light communication is vital in industrial applications, particularly for its high energy efficiency, high data transmission speeds that outperform other systems, and low interference. Given the limited research on visible light communication applications in industrial fields, improving lighting and communication efficiency still requires further study. Accordingly, this paper presents two new models for distributing lighting units within warehouses of varying dimensions and heights, each model providing lighting first, followed by communication. A new proposed model for industrial warehouses was designed, based on different lengths, widths, semi-angles at half-power (SAAHP), and height levels at different semi-angles, for metrics such as received power and signal-to-noise ratio (SNR) and bit error rate (BER). The study’s findings showed that the warehouse evenly distributes both the received power and the illumination. The dimensions of the warehouse were calculated using MATLAB simulations. This study can be implemented in industrial warehouses and conference rooms. This is a preview of subscription content, log in via an institution to check access. Price includes VAT (India) Instant access to the full article PDF. Institutional subscriptions S. Wu, H. Wang, C. Youn, IEEE Netw. (6)(2014). https://doi.org/10.1109/MNET.2014.6963803 Y. Almadani et al., Visible light communications for industrial applications—challenges and potentials. Electron. 9 (12), 1–38 (2020). https://doi.org/10.3390/electronics9122157 Article Google Scholar J. Lian, Z. Vatansever, M. Noshad, M. Brandt-Pearce, Indoor visible light communications, networking, and applications. JPhys Photonics (2019). https://doi.org/10.1088/2515-7647/aaf74a Article Google Scholar A.A. Qasim, M.F.L. Abdullah, Q.J. Kadhim, R. Talib, A.M. Alsahlany, M.S.M. Gismalla, Modelling 5 units illumination for visible light communication system. 2020 International Conference on Informa",
        "domain": "doi.org",
        "quality_score": 80,
        "identifier": "10.1007/s12596-025-02916-z",
        "accessed_at": "2026-01-19"
      },
      {
        "id": "S4",
        "title": "Deployment of the National Guard: Mobilization in Confusion",
        "url": "https://doi.org/10.21236/ada499409",
        "publisher": "Defense Technical Information Center",
        "published": "2009-3-27",
        "source_type": "academic",
        "snippet": "",
        "domain": "doi.org",
        "quality_score": 80,
        "identifier": "10.21236/ada499409",
        "accessed_at": "2026-01-19"
      },
      {
        "id": "S5",
        "title": "Family Reintegration Following Guard Deployment",
        "url": "https://doi.org/10.21236/ada633004",
        "publisher": "Defense Technical Information Center",
        "published": "2010-9-20",
        "source_type": "academic",
        "snippet": "",
        "domain": "doi.org",
        "quality_score": 80,
        "identifier": "10.21236/ada633004",
        "accessed_at": "2026-01-19"
      }
    ],
    "claims": {
      "claims": [
        {
          "id": "C001",
          "text": "Addressing these concerns requires a multi-faceted approach, with an appropriate security guard deployment ratio forming a cornerstone of effective warehouse protection [S1].",
          "claim_type": "policy",
          "citations": [
            "S2",
            "S1"
          ],
          "sources": [
            "S2",
            "S1"
          ],
          "domains": [
            "doi.org",
            "doi.org"
          ],
          "numbers": [],
          "issues": []
        },
        {
          "id": "C002",
          "text": "Compliance with these mandates is not merely a legal obligation but a crucial element of responsible warehouse management.",
          "claim_type": "policy",
          "citations": [],
          "sources": [],
          "domains": [],
          "numbers": [],
          "issues": [
            "Claim lacks citation."
          ]
        },
        {
          "id": "C003",
          "text": "Warehouses that handle personal data, such as employee records, vendor information, or customer details, must implement robust security protocols to prevent data breaches.",
          "claim_type": "policy",
          "citations": [],
          "sources": [],
          "domains": [],
          "numbers": [],
          "issues": [
            "Claim lacks citation."
          ]
        },
        {
          "id": "C004",
          "text": "Section 8(6) of the DPDP Act 2023 dictates implementing reasonable security safeguards to prevent data breaches, and failure to comply can result in significant penalties.",
          "claim_type": "regulatory",
          "citations": [],
          "sources": [],
          "domains": [],
          "numbers": [],
          "issues": [
            "Claim lacks citation.",
            "Regulatory claim lacks required sources."
          ]
        },
        {
          "id": "C005",
          "text": "Data breaches must be reported to the Data Protection Board of India, as per Section 17.",
          "claim_type": "policy",
          "citations": [],
          "sources": [],
          "domains": [],
          "numbers": [],
          "issues": [
            "Claim lacks citation."
          ]
        },
        {
          "id": "C006",
          "text": "The presence of trained security personnel can aid in the early detection and prevention of such incidents, ensuring compliance with the DPDP Act and safeguarding the privacy of individuals.",
          "claim_type": "policy",
          "citations": [],
          "sources": [],
          "domains": [],
          "numbers": [],
          "issues": [
            "Claim lacks citation."
          ]
        },
        {
          "id": "C007",
          "text": "The DPDP Act 2023 highlights the importance of data security in all operations, including warehousing, when personal data is processed.",
          "claim_type": "regulatory",
          "citations": [],
          "sources": [],
          "domains": [],
          "numbers": [],
          "issues": [
            "Claim lacks citation.",
            "Regulatory claim lacks required sources."
          ]
        },
        {
          "id": "C008",
          "text": "*   **Bharatiya Nagarik Suraksha Sanhita (BNSS):** The Bharatiya Nagarik Suraksha Sanhita (BNSS), formerly the Code of Criminal Procedure (CrPC), grants security guards certain powers of arrest in the case of cognisable offences occurring within the warehouse premises.",
          "claim_type": "regulatory",
          "citations": [],
          "sources": [],
          "domains": [],
          "numbers": [],
          "issues": [
            "Claim lacks citation.",
            "Regulatory claim lacks required sources."
          ]
        },
        {
          "id": "C009",
          "text": "Security personnel must be well-versed in the provisions of the BNSS to ensure they operate within the bounds of the law when exercising their powers of arrest and detention.",
          "claim_type": "policy",
          "citations": [],
          "sources": [],
          "domains": [],
          "numbers": [],
          "issues": [
            "Claim lacks citation."
          ]
        },
        {
          "id": "C010",
          "text": "*   **Indian Standards (IS 1550):** IS 1550 outlines standards for fire safety and security.",
          "claim_type": "regulatory",
          "citations": [],
          "sources": [],
          "domains": [],
          "numbers": [],
          "issues": [
            "Claim lacks citation.",
            "Regulatory claim lacks required sources."
          ]
        },
        {
          "id": "C011",
          "text": "Compliance with IS 1550 contributes to a safer and more secure warehouse environment.",
          "claim_type": "regulatory",
          "citations": [],
          "sources": [],
          "domains": [],
          "numbers": [],
          "issues": [
            "Claim lacks citation.",
            "Regulatory claim lacks required sources."
          ]
        },
        {
          "id": "C012",
          "text": "For example, adequate staffing ensures timely evacuation during a fire emergency, aligning with IS 1550 guidelines.",
          "claim_type": "regulatory",
          "citations": [],
          "sources": [],
          "domains": [],
          "numbers": [],
          "issues": [
            "Claim lacks citation.",
            "Regulatory claim lacks required sources."
          ]
        },
        {
          "id": "C013",
          "text": "IS 1550 also covers aspects of security planning and emergency preparedness, which are directly linked to the number of security personnel required to implement these plans effectively.",
          "claim_type": "regulatory",
          "citations": [],
          "sources": [],
          "domains": [],
          "numbers": [],
          "issues": [
            "Claim lacks citation.",
            "Regulatory claim lacks required sources."
          ]
        },
        {
          "id": "C014",
          "text": "*   **State-Specific Regulations:** In addition to national laws, warehouse owners must be aware of state-level regulations related to private security agencies and specific industries.",
          "claim_type": "policy",
          "citations": [],
          "sources": [],
          "domains": [],
          "numbers": [],
          "issues": [
            "Claim lacks citation."
          ]
        },
        {
          "id": "C015",
          "text": "To ensure compliance, warehouse owners should consult with local authorities and legal experts to identify and adhere to all applicable state-specific regulations.",
          "claim_type": "policy",
          "citations": [],
          "sources": [],
          "domains": [],
          "numbers": [],
          "issues": [
            "Claim lacks citation."
          ]
        },
        {
          "id": "C016",
          "text": "Determining the optimal security guard deployment ratio requires a systematic and comprehensive approach.",
          "claim_type": "policy",
          "citations": [],
          "sources": [],
          "domains": [],
          "numbers": [],
          "issues": [
            "Claim lacks citation."
          ]
        }
      ],
      "paragraph_map": [
        {
          "paragraph": 1,
          "citations": [],
          "claims": []
        },
        {
          "paragraph": 2,
          "citations": [
            "S1"
          ],
          "claims": []
        },
        {
          "paragraph": 3,
          "citations": [],
          "claims": []
        },
        {
          "paragraph": 4,
          "citations": [
            "S2",
            "S1"
          ],
          "claims": [
            "C001"
          ]
        },
        {
          "paragraph": 5,
          "citations": [
            "S2"
          ],
          "claims": []
        },
        {
          "paragraph": 6,
          "citations": [],
          "claims": []
        },
        {
          "paragraph": 7,
          "citations": [],
          "claims": [
            "C002"
          ]
        },
        {
          "paragraph": 8,
          "citations": [],
          "claims": [
            "C003",
            "C004",
            "C005",
            "C006",
            "C007"
          ]
        },
        {
          "paragraph": 9,
          "citations": [],
          "claims": [
            "C008",
            "C009"
          ]
        },
        {
          "paragraph": 10,
          "citations": [],
          "claims": [
            "C010",
            "C011",
            "C012",
            "C013"
          ]
        },
        {
          "paragraph": 11,
          "citations": [],
          "claims": [
            "C014",
            "C015"
          ]
        },
        {
          "paragraph": 12,
          "citations": [],
          "claims": []
        },
        {
          "paragraph": 13,
          "citations": [],
          "claims": [
            "C016"
          ]
        },
        {
          "paragraph": 14,
          "citations": [],
          "claims": []
        },
        {
          "paragraph": 15,
          "citations": [
            "S2"
          ],
          "claims": []
        },
        {
          "paragraph": 16,
          "citations": [],
          "claims": []
        },
        {
          "paragraph": 17,
          "citations": [],
          "claims": []
        }
      ],
      "contradictions": [],
      "issues": [
        "C002: Claim lacks citation.",
        "C003: Claim lacks citation.",
        "C004: Claim lacks citation.",
        "C004: Regulatory claim lacks required sources.",
        "C005: Claim lacks citation.",
        "C006: Claim lacks citation.",
        "C007: Claim lacks citation.",
        "C007: Regulatory claim lacks required sources.",
        "C008: Claim lacks citation.",
        "C008: Regulatory claim lacks required sources.",
        "C009: Claim lacks citation.",
        "C010: Claim lacks citation.",
        "C010: Regulatory claim lacks required sources.",
        "C011: Claim lacks citation.",
        "C011: Regulatory claim lacks required sources.",
        "C012: Claim lacks citation.",
        "C012: Regulatory claim lacks required sources.",
        "C013: Claim lacks citation.",
        "C013: Regulatory claim lacks required sources.",
        "C014: Claim lacks citation.",
        "C015: Claim lacks citation.",
        "C016: Claim lacks citation."
      ],
      "metrics": {
        "claim_count": 16,
        "numeric_claims": 0,
        "regulatory_claims": 7,
        "contradictions": 0
      }
    }
  }
}